[
  {
    "id": "section-1",
    "title": "Personal Profile",
    "content": "Personal Profile\n\nName: Zhi Hao, Lo (Jason)\nEmail: zhihao.lo@u.nus.edu\nPhone: +65 80237584\nWebsite: https://lordzhihao.vercel.app/\nLinkedIn: https://www.linkedin.com/in/zhi-hao-lo\nMedium: https://medium.com/@lozhihao\nGitHub: https://github.com/LordZhiHao\nSummary: Aspiring Data Scientist with 1+ years of experience in AI development, predictive analytics, and machine learning; passionate writer and investor.",
    "category": "Personal Information",
    "metadata": {
      "source": "resume",
      "section_number": 1
    }
  },
  {
    "id": "section-2",
    "title": "Education",
    "content": "Education\n\nInstitution: National University of Singapore\nLocation: Singapore\nDegree: BSc. in Business Analytics\nCAP: 4.33 / 5.0\nPeriod: Aug 2021 – Dec 2025 (Expected)\nSecond Major: Economics\nSpecializations: Machine Learning-based Analytics\nAwards: Certificate of Distinction in Analytics Techniques, Certificate of Distinction in Financial Analytics, Certificate of Distinction in ML-based Analytics, ASEAN Undergraduate Scholarship",
    "category": "Education",
    "metadata": {
      "source": "resume",
      "section_number": 2
    }
  },
  {
    "id": "section-3",
    "title": "Work Experience - AI Singapore",
    "content": "Work Experience - AI Singapore\n\nPosition: Audio AI Engineering Intern\nLocation: Singapore\nPeriod: Jun 2025 – Dec 2025 (Expected)\nProjects:\n• Developed data pipeline to create manifests for 690+GB of National Speech Corpus dataset for ASR and SQA task training\n• To be determined",
    "category": "Work Experience",
    "metadata": {
      "source": "resume",
      "section_number": 3
    }
  },
  {
    "id": "section-4",
    "title": "Work Experience - Munich Re",
    "content": "Work Experience - Munich Re\n\nPosition: Data Science Intern\nLocation: Singapore\nPeriod: May 2025 – Dec 2025 (Expected)\nProjects:\n• Designed and implemented a comprehensive OCR evaluation framework for underwriting documents (checkboxes, handwriting, tables, multi-doc formats); adopted across the department for GenAI solution benchmarking.\n• Built and deployed a document classifier for underwriting documents (11 classes), achieving 90% accuracy and 92% weighted F1-score using a LLaMA 3.3-based LLM model.\n• Exploring and comparing alternative document classification approaches, including Visual-Language Models (VLMs) with Mistral (68% accuracy) and fine-tuned LayoutLM (92% accuracy). Developed ensemble model using both LLaMa 3,3-based LLM model and fine-tuned LayoutLM to deliver high confidence predictions and highlight ambiguous files for review",
    "category": "Work Experience",
    "metadata": {
      "source": "resume",
      "section_number": 4
    }
  },
  {
    "id": "section-5",
    "title": "Work Experience - Wholly Greens Pte Ltd.",
    "content": "Work Experience - Wholly Greens Pte Ltd.\n\nPosition: Data Scientist Intern\nLocation: Singapore\nPeriod: Jan 2025 – Mar 2025\nProjects:\n• Finetuned object detection models using YOLOv8 model on GCP to create a robust data pipeline to accurately identify\nobjects retrieved by users from vending machines.\n• Conducted data annotation on CVAT platform for 5000+ object images from 40+ SKUs for model training and validation.\n• Researched on data pipeline to perform image clustering and remove duplicated image datapoints using FastDup and\nalternative clustering methodologies (Clustering on YOLOv8 embeddings, etc)",
    "category": "Work Experience",
    "metadata": {
      "source": "resume",
      "section_number": 5
    }
  },
  {
    "id": "section-6",
    "title": "Work Experience - Azure Tide Holdings",
    "content": "Work Experience - Azure Tide Holdings\n\nPosition: Data Analyst Intern\nLocation: Singapore\nPeriod: Aug 2024 – Jan 2025\nProjects:\n• Utilized Python to integrate with 5+ APIs (CoinMarketCap, CoinGecko, Debank, Binance, Blockchain.com) to collect and\nprocess data for over 20+ cryptocurrencies and wallets\n• Automated daily updates of cryptocurrency prices and conducted due diligence on counterparties’ financial situations,\nreducing manual workload by 90% per day and improving data accuracy\n• Performed data analysis, cleaning and visualization using Excel on the portfolio of counterparties, ensuring smooth credit\ndecision-making process\n• Streamlined the distribution of financial and market updates to 10+ stakeholders via Sheety, Slack, and Telegram APIs,\nreducing the update time by 80% and ensuring real-time communication\n• Leveraged Python scripts to provide real-time market insights, increasing reporting efficiency and enabling faster decisionmaking by 30%",
    "category": "Work Experience",
    "metadata": {
      "source": "resume",
      "section_number": 6
    }
  },
  {
    "id": "section-7",
    "title": "Work Experience - Continental AG",
    "content": "Work Experience - Continental AG\n\nPosition: Data Analytics Intern\nLocation: Singapore\nPeriod: Jan 2024 – Jun 2024\nProjects:\n• Designed and implemented a PowerBI dashboard to compare and filter similar projects, aiding project managers in identifying past project details and costs\n• Proposed and executed a redesign of the data relationships between 20+ tables in the project details management dashboard, streamlining data flows and improving efficiency\n• Employed PowerQuery for data cleaning and manipulation, and leveraged DAX measures to calculate key metrics (mean,\nmedian, standard deviation) for real-time project cost management\n• Enhanced data representation by performing data manipulation and proposing new visuals for the project attributes\ndashboard, improving clarity and insight into project details\n• Developed a dynamic organizational chart for manpower arrangement using Mendix, increasing human resource management efficiency through improved workforce visibility and planning",
    "category": "Work Experience",
    "metadata": {
      "source": "resume",
      "section_number": 7
    }
  },
  {
    "id": "section-8",
    "title": "Work Experience - Jurong Town Corporation (JTC)",
    "content": "Work Experience - Jurong Town Corporation (JTC)\n\nPosition: Data Science Intern\nLocation: Singapore\nPeriod: May 2023 – Aug 2023\nProjects:\n• Conducted data cleansing, preprocessing, feature engineering, and developed machine learning models to accurately predict\nthe occupancy rate of sub-segments within the industrial property sector\n• Improved Mean Absolute Error of model predictions to 0.21% quarterly hence reducing the number of occupancy rate\nsurveys needed by the company from 4 to 2 times per year\n• Identified and visualized key factors that significantly contribute to higher premiums observed in both food and generic\nindustrial space",
    "category": "Work Experience",
    "metadata": {
      "source": "resume",
      "section_number": 8
    }
  },
  {
    "id": "section-9",
    "title": "Teaching Experience",
    "content": "Teaching Experience\n\nInstitution: National University of Singapore, School of Computing\nRole: Teaching Assistant\nCourse: IS1108 Digital Ethics and Data Privacy\nPeriod: Jan 2023 – Dec 2023\nDetails:\n• Facilitated a 25-student tutorial class to conduct discussion and learning on computing ethics and data privacy challenges\nin contemporary culture\n• Collaborated with Teaching Assistants to grade and review assignments for course participants",
    "category": "Teaching",
    "metadata": {
      "source": "resume",
      "section_number": 9
    }
  },
  {
    "id": "section-10",
    "title": "Project - Data Analyst Agent Development",
    "content": "Project - Data Analyst Agent Development\n\nType: Consultancy Project\nPeriod: Mar 2025 – May 2025 (Expected)\nCompany: Rank Possible Sdn. Bhd. \nDetails:\n• Developed an MVP for a data analyst agent to help marketing teams extract insights from BigQuery without requiring\nSQL or coding expertise.\n• Built a full-stack web app using React.js and Recharts for frontend visualizations, and FastAPI to connect backend services.\n• Integrated Vanna AI to implement a RAG-reinforced text-to-SQL agent, leveraging historical query pairs to improve output\naccuracy over time.\n• Queried and analyzed two client-provided BigQuery tables (20+ columns each) using natural language inputs from nontechnical users.\n• Integrated Gemini-2.0-flash with Chain-of-Thought prompting to analyze queried dataset outputs, data cards, and descriptive statistics, generating chart suggestions, data insights, and recommended next steps.\n• Employed MongoDB for vector storage in the RAG pipeline and used Python for backend orchestration and data parsing.\n• Deployed an active demo website for client testing and iteration; continuously refining based on user feedback.",
    "category": "Projects",
    "metadata": {
      "source": "resume",
      "section_number": 10
    }
  },
  {
    "id": "section-11",
    "title": "Project - Portfolio Website & AI Chatbot",
    "content": "Project - Portfolio Website & AI Chatbot\n\nType: Personal Project\nPeriod: Jan 2025 – Present\nCompany: Myself, at https://lordzhihao.vercel.app/\nDetails:\n• Designed and deployed a personal portfolio website using React.js and Vercel to showcase projects, education, and work\nexperience.\n• Integrated EmailJS to enable automated email responses for visitor inquiries, enhancing interactivity and outreach.\n• Built and deployed an AI-powered personal chatbot using a RAG architecture with FastAPI backend, Pinecone vector\nstore, and Gemini-2.0-flash as the LLM.\n• Engineered conversation memory with a rolling window of 10 messages to maintain chat context and improve response\nrelevance.\n• Developed the chatbot to answer questions about personal background, projects, and experience, offering an interactive\nway for visitors to explore the portfolio.",
    "category": "Projects",
    "metadata": {
      "source": "resume",
      "section_number": 11
    }
  },
  {
    "id": "section-12",
    "title": "Project - Bon-AIPetit",
    "content": "Project - Bon-AIPetit\n\nType: Gamuda AI Academy Project (won 1st Runner-Up for best project)\nPeriod: Jan 2025 – Mar 2025\nCompany: Gamuda (Apprenticeship)\nDetails:\n• Led a team of 5 to design and deploy an AI-powered web application that transforms leftover ingredients into personalized\nmeals, promoting sustainability through smart technology.\n• Implemented a RAG-based system using Vertex AI Gemini-2.0-flash, MongoDB (vector embeddings), and Cloud SQL to\npower recipe generation, personalized meal planning, and a conversational Chef-bot.\n• Built a full-stack solution with Vue.js + Vuetify on the frontend (Firebase Hosting) and Python (FastAPI) on the backend\n(GCP Cloud Run); managed CI/CD using GitHub Actions.\n• Integrated ensemble models using Google Cloud Vision API to extract ingredients and text from grocery receipts and\nimages, reducing false positives in ingredients detection and OCR.\n• Enabled three core features: (1) Recipe Generator from ingredient photos, (2) Smart Meal Planner with nutritional tracking and grocery list, and (3) AI Chef-bot with context-aware chat.",
    "category": "Projects",
    "metadata": {
      "source": "resume",
      "section_number": 12
    }
  },
  {
    "id": "section-13",
    "title": "Project - Coca-Cola Cargo Permit Automation",
    "content": "Project - Coca-Cola Cargo Permit Automation\n\nType: Capstone Project\nCompany: The Coca-Cola Company\nPeriod: Aug 2024 – Nov 2024\nDetails:\n• Led the automation of cargo permit data extraction using Python, OpenCV, and YOLOv8, reducing manual processing\ntime by 30% and boosting workflow efficiency.\n• Generated synthetic data with cv2 and annotated 700+ permits using Roboflow, increasing training data by 80% and\nimproving object detection robustness.\n• Fine-tuned YOLOv8 for bounding box detection and implemented OCR pipelines with Pytesseract, Doctr, and PaddleOCR, achieving 99% text extraction precision.",
    "category": "Projects",
    "metadata": {
      "source": "resume",
      "section_number": 13
    }
  },
  {
    "id": "section-14",
    "title": "Project - Crop Demand Forecasting (Sarisuki)",
    "content": "Project - Crop Demand Forecasting (Sarisuki)\n\nType: Consultancy Project\nCompany: Sarisuki\nPeriod: Jan 2024 – May 2024\nDetails:\n• Led a team of 4 to develop a short-term crop price forecasting system for 19 agricultural products using Python.\n2• Engineered features and performed time series analysis using ARIMA, SARIMA, VARIMA, LSTM, and Transformer\nmodels.\n• Evaluated model performance via MAE and MAPE, conducting backtesting to identify optimal models per crop and time\nhorizon (1–3 days ahead).\n• Utilized Python & Jupyter Notebooks for experimentation and documentation throughout the modelling pipeline.\n• Presented a final technical report to Sarisuki, delivering actionable insights for pricing strategy and supply chain optimization.",
    "category": "Projects",
    "metadata": {
      "source": "resume",
      "section_number": 14
    }
  },
  {
    "id": "section-15",
    "title": "Miscellaneous Projects",
    "content": "Miscellaneous Projects\n\n• BrainHack 2023 - SeeTrue Category: Developed deep learning models in NLP & CV to classify fake social media\nusers, achieving an overall accuracy of 81% and a top 10 overall rankings\n• SDS Datathon 2024 - SingLife Analytics & Machine Learning: Developed machine learning models & performed\nvisualization & analytics to classify fraudulent SingLife insurance claims, achieving an accuracy of 95% & f1-score of 35%\n• EasyIntern - Internship Recommendation System: End to end website embedded with a job recommendation system to allow internship seekers to apply for internships with ease",
    "category": "Projects",
    "metadata": {
      "source": "resume",
      "section_number": 15
    }
  },
  {
    "id": "section-16",
    "title": "Leadership - BACT",
    "content": "Leadership - BACT\n\nRole: Vice-President (Internal) & Senior Analyst\nPeriod: Aug 2023 – Aug 2024\nResponsibilities:\n• Led a consultancy project (see Projects) under BACT to deliver short-term crop price forecasting for Sarisuki.\n• Managed a publicity team of 4 to oversee social media platforms (Instagram, LinkedIn, Telegram), posting events and\nupdates for over 300 followers on Instagram and LinkedIn, and 80 members on Telegram\n• Collaborated with Alteryx and Xopa.ai to organize sharings, talks, and hackathons for club members and analysts\n• Facilitated weekly data analytics events, coordinating with external parties to deliver machine learning and data analytics\nsessions for 80+ members",
    "category": "Leadership",
    "metadata": {
      "source": "resume",
      "section_number": 16
    }
  },
  {
    "id": "section-17",
    "title": "Leadership - NUS Pioneer House",
    "content": "Leadership - NUS Pioneer House\n\nRoles: Peer Mentor, Cooking Interest Group Leader, Orientation Group Leader\nPeriod: Jun 2022 – Jun 2024\nResponsibilities:\n• Mentored 15 residents on academics, campus life, and personal development as part of the Peer Mentorship Programme.\n• Organised and hosted events for up to 70 residents to strengthen engagement, inclusivity, and community bonding.\n• Served as Orientation Group Leader (OGL) for PH Freshman Orientation Camp 2022/2023, leading a group of incoming\nstudents through onboarding and team-building activities.\n• Facilitated two-way communication between residents and management by relaying feedback and advocating for resident\nneeds to improve hostel living experience.\n• Oversaw performance of 7 student leaders under the PCT programme, ensuring smooth execution of weekly activities and\neffective peer leadership.\n• Led 12 biweekly cooking events for up to 20 participants per session; planned menus, managed ingredient preparation, and\nhandled participant signups.\n• Collaborated with Monofood (NGO) to organise an “Ugly Food” event promoting sustainability and food waste reduction.",
    "category": "Leadership",
    "metadata": {
      "source": "resume",
      "section_number": 17
    }
  },
  {
    "id": "section-18",
    "title": "Leadership - NUS Prince George’s Park Residences (PGPR)",
    "content": "Leadership - NUS Prince George’s Park Residences (PGPR)\n\nRole: Badminton Sports Clinic Leader\nPeriod: Aug 2024 – Dec 2024\nResponsibilities:\n• Organised and led 8 biweekly badminton clinics for PGPR residents, with 10–12 participants per session.\n• Managed court bookings, equipment preparation, and hydration logistics to ensure smooth event execution.\n• Instructed beginner-friendly badminton drills, techniques, and rules, catering to newcomers and casual players.\n• Led warm-up and cool-down routines while fostering an inclusive and active community environment through sports.",
    "category": "Leadership",
    "metadata": {
      "source": "resume",
      "section_number": 18
    }
  },
  {
    "id": "section-19",
    "title": "Skills",
    "content": "Skills\n\nLanguages: Python, R, SQL, Java, JavaScript, HTML, CSS\nFrameworks: VueJs, Vuetify, ReactJs, Firebase, Pandas, Numpy, Sklearn, Pytorch, Ultralytics, LangChain, Airflow, Selenium, Bs4, Streamlit, FastAPI, Pydantic\nTools: PowerBI, Tableau, Excel, UiPath, Alteryx, Figma, MySQL, PostgreSQL, MongoDB, Pinecone, Docker\nCloud: Cloud SQL, BigQuery, Vertex AI, Cloud Run\nCertifications: UiPath RPA Developer Foundations, CFI DS & ML Fundamentals, Gamuda AI Academy Graduate\nLanguages Spoken: Fluent in English, Mandarin, Malay; Competent in written English, Mandarin, Malay",
    "category": "Skills",
    "metadata": {
      "source": "resume",
      "section_number": 19
    }
  }
]